Repository: Sulamaxx/bus_booking_app
Catalog: lib/l10n/app_*.arb
Languages: si

source: Welcome!
si: සාදරයෙන් පිළිගනිමු!

# sign_in_btn
source: Sign In
si: ඇතුල් වන්න

# sign_up_btn
source: Sign Up
si: ලියාපදිංචි වන්න

# login_page_title
source: Sign In
si: ඇතුල් වන්න

source: Email
si: විද්යුත් තැපෑල

# email_validation_empty
source: Please enter your email
si: කරුණාකර ඔබගේ විද්‍යුත් තැපෑල ඇතුලත් කරන්න

source: Password
si: මුරපදය

# password_validation_empty
source: Please enter your password
si: ඔබගේ මුරපදය ඇතුල් කරන්න

# not_yet_register
source: Not registered yet? Click here
si: තවමත් ලියාපදිංචි වී නැද්ද? මෙහි ක්ලික් කරන්න

# auth_user_log_null
source: Invalid Email or Password
si: වලංගු නොවන ඊමේල් හෝ මුරපදය

# auth_user_log_not_null
source: Sign In successful!
si: පුරනය වීම සාර්ථකයි!

# nic_passport
source: NIC/Passport Number
si: ජාතික හැඳුනුම්පත/විදේශ ගමන් බලපත්‍ර අංකය

# nic_passport_validation
source: Please enter your NIC/Passport number
si: කරුණාකර ඔබගේ ජාතික හැඳුනුම්පත/විදේශ ගමන් බලපත්‍ර අංකය ඇතුලත් කරන්න

source: Mobile Number
si: ුරකථන අංකය

# mobile_number_validation
source: Please enter your mobile number
si: කරුණාකර ඔබගේ ජංගම දුරකථන අංකය ඇතුලත් කරන්න

# gender_male
source: Male
si: පිරිමි

# gender_female
source: Female
si: ගැහැණු

source: Gender
si: ස්ත්රී පුරුෂ භාවය

# gender_validation
source: Please select your gender
si: කරුණාකර ඔබේ ලිංගභේදය තෝරන්න

# already_exist_account
source: Already have an account? Click here
si: දැනටමත් ගිණුමක් තිබේද? මෙහි ක්ලික් කරන්න

# sign_up_auth_password_length
source: Password should be at least 6 characters
si: මුරපදය අවම වශයෙන් අක්ෂර 6 ක් විය යුතුය

# sign_up_auth_email_already_exist
source: The email address is already in use by another account.
si: ඊමේල් ලිපිනය දැනටමත් වෙනත් ගිණුමක් භාවිතා කරයි.

# sign_up_auth_invalid_email
source: Invalid email check again
si: අවලංගු විද්‍යුත් තැපෑල නැවත පරීක්ෂා කරන්න

# sign_up_auth_register_success
source: Registration successful!
si: ලියාපදිංචිය සාර්ථකයි!
